[
{"Air Lock": "Blocks the effects of weather."},
{"Arena Trap": "Prevents opposing grounded Pokemon from switching and increases wild encounter rate."},
{"Battle Armor": "Prevents critical hits."},
{"Blaze": "Boosts power of Fire-type moves 50% when at 1/3 of max HP or less."},
{"Chlorophyll": "Speed doubles in sun."},
{"Clear Body": "Stops the enemy from lowering this Pokemon's stats."},
{"Cloud Nine": "Blocks the effects of weather."},
{"Color Change": "Changes user's type to type of last attack that hit this Pokemon."},
{"Compound Eyes": "Raises accuracy by 30% and increases the probability of wild Pokemon holding items."},
{"Cute Charm": "Can infatuate Pokemon of opposite gender when struck and increases their wild encounter rate."},
{"Damp": "Prevents the use of Self-Destruct or Explosion."},
{"Drizzle": "Summons permanent rain."},
{"Drought": "Summons permanent sun."},
{"Early Bird": "Reduces sleep time by 50%."},
{"Effect Spore": "Induces paralysis, poison, or sleep on contact."},
{"Flame Body": "Enemies' contact moves have a 30% chance to burn them. Halves the amount of steps required to hatch Eggs."},
{"Flash Fire": "Grants immunity to Fire and increases Fire's power 50% when hit by a Fire move."},
{"Forecast": "Changes type according to weather."},
{"Guts": "Attack is increased 50% when afflicted by a non-volatile status. Ignores the Attack drop from burn."},
{"Huge Power": "Doubles Attack."},
{"Hustle": "Physical moves do 50% more damage at the cost of 20% accuracy. Increases wild encounter rate with higher level Pokemon."},
{"Hyper Cutter": "Prevents the enemy from lowering this Pokemon's Attack. Increases Cut's area of effect."},
{"Illuminate": "Increases wild encounter rate (no effect in battles)."},
{"Immunity": "This Pokemon cannot be poisoned."},
{"Inner Focus": "Prevents flinching."},
{"Insomnia": "Prevents sleep."},
{"Intimidate": "Lowers the foe's Attack by 1 stage. Decreases wild encounter rate."},
{"Keen Eye": "Pokemon's accuracy cannot be lowered. Decreases wild encounter rate."},
{"Levitate": "This Pokemon is immune to Ground-type moves and the effects of Spikes. Arena Trap will not prevent this Pokemon from Switching."},
{"Lightning Rod": "All Electric-type attacks target this Pokemon."},
{"Limber": "Blocks paralysis."},
{"Liquid Ooze": "Leeching moves cause the enemy to lose HP instead."},
{"Magma Armor": "Cannot be frozen. Halves the amount of steps required to hatch Eggs."},
{"Magnet Pull": "Prevents opposing Steel-type Pokemon from switching. Increases the chance of encountering a Steel-type Pokemon in the wild."},
{"Marvel Scale": "Boosts Defense 50% when afflicted by a non-volatile status."},
{"Minus": "If allied with a Pokemon with Plus, its Special Attack increases by 50%."},
{"Natural Cure": "Cures status on switching out."},
{"Oblivious": "Grants immunity to infatuation."},
{"Overgrow": "Raises the power of Grass-type moves by 50% when at 1/3 HP or less."},
{"Own Tempo": "Cannot be confused."},
{"Pickup": "Adds a chance of finding an item after each battle (no effect in battles)."},
{"Plus": "If allied with a Pokemon with Minus, its Special Attack increases by 50%."},
{"Poison Point": "Enemies' contact moves have a 30% chance of poisoning them."},
{"Pressure": "Enemy attacks lose 1 extra PP. Increases wild encounter rate."},
{"Pure Power": "Doubles Attack."},
{"Rain Dish": "Heals 1/16 of max HP in rain."},
{"Rock Head": "Negates recoil from recoil moves."},
{"Rough Skin": "Deals 1/8 recoil damage when the opponent makes contact."},
{"Run Away": "Increases the chance of successfully escaping battle with a wild Pokemon."},
{"Sand Stream": "Summons permanent sandstorm."},
{"Sand Veil": "Evasion increases by 20% in a sandstorm. User becomes immune to sand damage."},
{"Serene Grace": "This Pokemon's secondary effect chances are doubled."},
{"Shadow Tag": "Prevents opposing Pokemon from switching."},
{"Shed Skin": "30% chance to heal status."},
{"Shell Armor": "Prevents critical hits."},
{"Shield Dust": "Secondary effects won't occur."},
{"Soundproof": "Unaffected by sound moves."},
{"Speed Boost": "Speed raises at end of turn. Does not boost Speed when the user switches in."},
{"Static": "Enemies' contact moves can paralyze them."},
{"Stench": "Decreases wild encounter rate (no effect in battles)."},
{"Sticky Hold": "This Pokemon's item cannot be removed. Increases the chance of encountering Pokemon while fishing."},
{"Sturdy": "OHKO moves will fail."},
{"Suction Cups": "Cannot be forced to switch. Increases chance of encountering Pokemon while fishing."},
{"Swarm": "Boosts power of Bug-type moves by 50% when at 1/3 HP or less."},
{"Swift Swim": "Speed doubles in rain."},
{"Synchronize": "When statused, the enemy is also statused. Can pass nature to wild Pokemon."},
{"Thick Fat": "Halves Ice- and Fire-type damage."},
{"Torrent": "Boosts power of Water-type moves by 50% when at 1/3 HP or less."},
{"Trace": "Copies foe's ability."},
{"Truant": "This Pokemon does nothing every other turn."},
{"Vital Spirit": "Prevents sleep. Increases wild encounters with higher level Pokemon."},
{"Volt Absorb": "Heals 25% HP when hit by an Electric-type attack."},
{"Water Absorb": "Heals 25% HP when hit by a Water-type attack."},
{"Water Veil": "Prevents burn."},
{"White Smoke": "Prevents the enemy from lowering this Pokemon's stats and decreases wild encounter rate."},
{"Wonder Guard": "Only super effective attacks harm this Pokemon."}
]